app/controllers/vehiculos_controller.rb

  def index
    @vehiculos = Vehiculo.all
---
SELECT "vehiculos".* FROM "vehiculos"

  def create
    @vehiculo = Vehiculo.new(vehiculo_params)

    respond_to do |format|
      if @vehiculo.save
---
INSERT INTO "vehiculos" ("ruedas", "motor", "cant_pasajeros", "placa", "anyo", "precio", "observacion", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_vehiculo
      @vehiculo = Vehiculo.find(params[:id])
---
SELECT  "vehiculos".* FROM "vehiculos" WHERE "vehiculos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]